{"EM-Stuff":{"slug":"EM-Stuff","title":"EM Stuff","links":[],"tags":[],"content":"\nDonkey"},"Look-at-this":{"slug":"Look-at-this","title":"Look at this","links":["EM-Stuff"],"tags":[],"content":"EM Stuff"},"Welcome":{"slug":"Welcome","title":"Welcome","links":["create-a-link"],"tags":[],"content":"This is your new vault.\nMake a note of something, create a link, or try the Importer!\nWhen you’re ready, delete this note and make the vault your own."},"index":{"slug":"index","title":"Welcome to Quartz 4","links":["showcase","authoring-content","configuration","layout","build","setting-up-your-GitHub-repository","hosting","Obsidian-compatibility","full-text-search","graph-view","wikilinks","backlinks","features/Latex","syntax-highlighting","popover-previews","Docker-Support","i18n","comments","features","creating-components","SPA-Routing","making-plugins","philosophy","architecture","upgrading"],"tags":[],"content":"Quartz is a fast, batteries-included static-site generator that transforms Markdown content into fully functional websites. Thousands of students, developers, and teachers are already using Quartz to publish personal notes, websites, and digital gardens to the web.\n🪴 Working on it!\nQuartz requires at least Node v20 and npm v9.3.1 to function correctly. Ensure you have this installed on your machine before continuing.\nThen, in your terminal of choice, enter the following commands line by line:\ngit clone github.com/jackyzha0/quartz.git\ncd quartz\nnpm i\nnpx quartz create\nThis will guide you through initializing your Quartz with content. Once you’ve done so, see how to:\n\nWriting content in Quartz\nConfigure Quartz’s behaviour\nChange Quartz’s layout\nBuild and preview Quartz\nSync your changes with GitHub\nHost Quartz online\n\nIf you prefer instructions in a video format you can try following Nicole van der Hoeven’s\nvideo guide on how to set up Quartz!\n🔧 Features\n\nObsidian compatibility, full-text search, graph view, note transclusion, wikilinks, backlinks, Latex, syntax highlighting, popover previews, Docker Support, internationalization, comments and many more right out of the box\nHot-reload for both configuration and content\nSimple JSX layouts and page components\nRidiculously fast page loads and tiny bundle sizes\nFully-customizable parsing, filtering, and page generation through plugins\n\nFor a comprehensive list of features, visit the features page. You can read more about the why behind these features on the philosophy page and a technical overview on the architecture page.\n🚧 Troubleshooting + Updating\nHaving trouble with Quartz? Try searching for your issue using the search feature. If you haven’t already, upgrade to the newest version of Quartz to see if this fixes your issue.\nIf you’re still having trouble, feel free to submit an issue if you feel you found a bug or ask for help in our Discord Community."},"popover-previews":{"slug":"popover-previews","title":"popover previews","links":[],"tags":[],"content":""}}